lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
    if (!radio_.begin()) {
      return false;
    }
    radio_.loadAddressFromFicr();
    radio_.setAdvertisingPduType(xiao_nrf54l15::BleAdvPduType::kAdvInd);
    radio_.setAdvertisingChannelSelectionAlgorithm2(false);
    radio_.clearCustomGatt();
    radio_.setGattDeviceName(Bluefruit.device_name_);
    radio_.setGattAppearance(Bluefruit.appearance_);
    radio_.setCustomGattWriteCallback(&BluefruitCompatManager::gattWriteThunk, this);

    if (Bluefruit.auto_conn_led_) {
      pinMode(LED_BUILTIN, OUTPUT);
      digitalWrite(LED_BUILTIN, kLedOffState);
    }

    started_ = true;
    last_connected_ = radio_.isConnected();
    last_connection_role_ = radio_.connectionRole();
    return true;
  }

  BleRadio& radio() { return radio_; }
  const BleRadio& radio() const { return radio_; }

  bool registerCharacteristic(BLECharacteristic* characteristic) {
    if (characteristic == nullptr || characteristic_count_ >= kMaxCharacteristics) {
      return false;
    }
    characteristics_[characteristic_count_++] = characteristic;
    return true;
  }

  bool registerClientCharacteristic(BLEClientCharacteristic* characteristic) {
    if (characteristic == nullptr) {
      return false;
    }
    for (uint8_t i = 0U; i < client_characteristic_count_; ++i) {
      if (client_characteristics_[i] == characteristic) {
        return true;
      }
    }
    if (client_characteristic_count_ >= kMaxClientCharacteristics) {
      return false;
    }
    client_characteristics_[client_characteristic_count_++] = characteristic;
    return true;
  }

  void markAdvertisingDirty() {
    Bluefruit.Advertising.dirty_ = true;
    Bluefruit.ScanResponse.dirty_ = true;
  }

  void advertisingStarted() {
    adv_started_ms_ = millis();
    next_adv_due_us_ = 0U;
  }

  BLEConnection* connection() { return &connection_; }

  bool queueCentralConnect(const ble_gap_evt_adv_report_t* report) {
    if (report == nullptr) {
      return false;
    }
    memcpy(pending_connect_address_, report->peer_addr.addr, sizeof(pending_connect_address_));
    pending_connect_random_ =
        (report->peer_addr.addr_type == BLE_GAP_ADDR_TYPE_RANDOM_STATIC) ? 1U : 0U;
    pending_connect_valid_ = true;
    Bluefruit.Scanner.paused_ = true;
    return maybeConnectCentral();
  }

  void handleCentralConnectionEvent(const BleConnectionEvent& event) {
    if (!(event.packetReceived && event.crcOk && event.attPacket && event.payload != nullptr &&
          event.payloadLength >= 7U)) {
      return;
    }
    const uint8_t attOpcode = event.payload[4];
    if (attOpcode != kAttOpHandleValueNtf) {
      return;
    }

    const uint16_t valueHandle = readLe16(&event.payload[5]);
    const uint16_t valueLength =
        (event.payloadLength >= 7U) ? static_cast<uint16_t>(event.payloadLength - 7U) : 0U;
    const uint8_t* value = &event.payload[7];
    for (uint8_t i = 0U; i < client_characteristic_count_; ++i) {
      BLEClientCharacteristic* characteristic = client_characteristics_[i];
      if (characteristic == nullptr || !characteristic->discovered_) {
        continue;
      }
      if (characteristic->value_handle_ == valueHandle) {
        characteristic->handleNotify(value, valueLength);
        return;
      }
    }
  }

  void idleService() {
    if (!started_) {
      return;
    }

    if (!radio_.isConnected()) {
      maybeAdvertise();
      maybeScanOrConnect();
    }

    const bool connected = radio_.isConnected();
    if (connected != last_connected_) {
      handleConnectionEdge(connected);
      last_connected_ = connected;
    }

    if (connected) {
      if (radio_.connectionRole() == BleConnectionRole::kPeripheral) {
        for (uint8_t i = 0U; i < characteristic_count_; ++i) {
          if (characteristics_[i] != nullptr) {
            characteristics_[i]->pollCccdState();
          }
        }
      } else if (radio_.connectionRole() == BleConnectionRole::kCentral) {
        processCentralBackgroundEvents(4U);
      }
    }
  }

 private:
  static constexpr uint8_t kMaxCharacteristics = 24U;
  static constexpr uint8_t kMaxClientCharacteristics = 16U;

  BleRadio radio_;
  bool started_;
  bool last_connected_;
  BleConnectionRole last_connection_role_;
  uint32_t next_adv_due_us_;
  unsigned long adv_started_ms_;
  bool scan_rsp_name_added_;
  BLECharacteristic* characteristics_[kMaxCharacteristics];
  uint8_t characteristic_count_;
  BLEClientCharacteristic* client_characteristics_[kMaxClientCharacteristics];
  uint8_t client_characteristic_count_;
  BLEConnection connection_;
  ble_gap_evt_adv_report_t scan_report_;
  uint8_t scan_report_data_[31];
  uint8_t scan_report_len_;
  bool pending_connect_valid_;
  uint8_t pending_connect_address_[6];
  uint8_t pending_connect_random_;
  unsigned long last_connect_attempt_ms_;

  static void gattWriteThunk(uint16_t valueHandle, const uint8_t* value,
                             uint8_t valueLength, bool withResponse, void* context) {
    (void)withResponse;
    auto* self = static_cast<BluefruitCompatManager*>(context);
    if (self != nullptr) {
      self->handleGattWrite(valueHandle, value, valueLength);
    }
  }

  void handleGattWrite(uint16_t valueHandle, const uint8_t* value, uint8_t valueLength) {
    for (uint8_t i = 0U; i < characteristic_count_; ++i) {
      BLECharacteristic* characteristic = characteristics_[i];
      if (characteristic == nullptr) {
        continue;
      }
      if (characteristic->_handles.value_handle == valueHandle) {
        characteristic->handleWriteFromRadio(value, valueLength);
        return;
      }
    }
  }

  static void fillReportType(uint8_t pduHeader, ble_gap_adv_report_type_t* outType) {
    if (outType == nullptr) {
      return;
    }
    memset(outType, 0, sizeof(*outType));
    switch (pduHeader & 0x0FU) {
      case 0x00U:
        outType->connectable = 1U;
        outType->scannable = 1U;
        break;
      case 0x01U:
        outType->connectable = 1U;
        outType->directed = 1U;
        break;
      case 0x02U:
        break;
      case 0x04U:
      case 0x06U:
        outType->scannable = 1U;
        break;
      default:
        break;
    }
  }

  bool buildScanReport(const xiao_nrf54l15::BleScanPacket& packet) {
    if (packet.payload == nullptr || packet.length < 6U) {
      return false;
    }
    memset(&scan_report_, 0, sizeof(scan_report_));
    memcpy(scan_report_.peer_addr.addr, packet.payload, 6U);
    scan_report_.peer_addr.addr_type =
        ((packet.pduHeader >> 6U) & 0x1U) ? BLE_GAP_ADDR_TYPE_RANDOM_STATIC
                                          : BLE_GAP_ADDR_TYPE_PUBLIC;
    scan_report_.rssi = packet.rssiDbm;
    fillReportType(packet.pduHeader, &scan_report_.type);

