lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
    scan_report_len_ = static_cast<uint8_t>(packet.length - 6U);
    if (scan_report_len_ > sizeof(scan_report_data_)) {
      scan_report_len_ = sizeof(scan_report_data_);
    }
    if (scan_report_len_ > 0U) {
      memcpy(scan_report_data_, &packet.payload[6], scan_report_len_);
    }
    scan_report_.data.p_data = scan_report_data_;
    scan_report_.data.len = scan_report_len_;
    return true;
  }

  bool buildScanReport(const xiao_nrf54l15::BleActiveScanResult& result) {
    if (result.advPayloadLength < 6U) {
      return false;
    }
    memset(&scan_report_, 0, sizeof(scan_report_));
    memcpy(scan_report_.peer_addr.addr, result.advertiserAddress, 6U);
    scan_report_.peer_addr.addr_type =
        result.advertiserAddressRandom ? BLE_GAP_ADDR_TYPE_RANDOM_STATIC
                                       : BLE_GAP_ADDR_TYPE_PUBLIC;
    scan_report_.rssi = result.advRssiDbm;
    fillReportType(result.advHeader, &scan_report_.type);

    scan_report_len_ = result.advDataLength();
    if (scan_report_len_ > sizeof(scan_report_data_)) {
      scan_report_len_ = sizeof(scan_report_data_);
    }
    if (scan_report_len_ > 0U && result.advData() != nullptr) {
      memcpy(scan_report_data_, result.advData(), scan_report_len_);
    }
    scan_report_.data.p_data = scan_report_data_;
    scan_report_.data.len = scan_report_len_;
    return true;
  }

  bool currentReportMatchesFilters() const {
    if (Bluefruit.Scanner.has_filter_rssi_ &&
        scan_report_.rssi < Bluefruit.Scanner.filter_rssi_dbm_) {
      return false;
    }
    if (Bluefruit.Scanner.has_filter_uuid_ &&
        !adDataHasUuid(scan_report_.data.p_data, scan_report_.data.len,
                       Bluefruit.Scanner.filter_uuid_)) {
      return false;
    }
    if (Bluefruit.Scanner.has_filter_msd_ &&
        !adDataHasMsdCompany(scan_report_.data.p_data, scan_report_.data.len,
                             Bluefruit.Scanner.filter_msd_company_)) {
      return false;
    }
    return true;
  }

  bool maybeConnectCentral() {
    if (!pending_connect_valid_) {
      return false;
    }
    const unsigned long now = millis();
    if ((now - last_connect_attempt_ms_) < 250UL) {
      return false;
    }
    last_connect_attempt_ms_ = now;
    if (!radio_.initiateConnection(pending_connect_address_, pending_connect_random_ != 0U,
                                   24U, 200U, 9U, 1200000UL)) {
      return false;
    }
    pending_connect_valid_ = false;
    return true;
  }

  void maybeScanOrConnect() {
    if (pending_connect_valid_) {
      (void)maybeConnectCentral();
      return;
    }
    if (!Bluefruit.Scanner.running_ || Bluefruit.Scanner.paused_ ||
        Bluefruit.Scanner.rx_callback_ == nullptr) {
      return;
    }

    bool gotReport = false;
    if (Bluefruit.Scanner.active_scan_) {
      xiao_nrf54l15::BleActiveScanResult result{};
      if (radio_.scanActiveCycle(&result, 300000UL, 200000UL)) {
        gotReport = buildScanReport(result);
      }
    } else {
      xiao_nrf54l15::BleScanPacket packet{};
      if (radio_.scanCycle(&packet, 300000UL)) {
        gotReport = buildScanReport(packet);
      }
    }
    if (!gotReport || !currentReportMatchesFilters()) {
      return;
    }

    Bluefruit.Scanner.paused_ = true;
    Bluefruit.Scanner.rx_callback_(&scan_report_);
    if (pending_connect_valid_) {
      (void)maybeConnectCentral();
    }
  }

  void processCentralBackgroundEvents(uint8_t maxEvents) {
    for (uint8_t i = 0U; i < maxEvents; ++i) {
      BleConnectionEvent event{};
      if (!radio_.consumeDeferredConnectionEvent(&event)) {
        break;
      }
      handleCentralConnectionEvent(event);
    }
  }

  bool applyAdvertisingPayloads() {
    if (!radio_.setAdvertisingPduType(
            static_cast<xiao_nrf54l15::BleAdvPduType>(Bluefruit.Advertising.adv_type_))) {
      return false;
    }
    if (!radio_.setAdvertisingData(Bluefruit.Advertising.data_, Bluefruit.Advertising.len_)) {
      return false;
    }
    if (!radio_.setScanResponseData(Bluefruit.ScanResponse.data_, Bluefruit.ScanResponse.len_)) {
      return false;
    }
    Bluefruit.Advertising.dirty_ = false;
    Bluefruit.ScanResponse.dirty_ = false;
    return true;
  }

  void maybeAdvertise() {
    if (!Bluefruit.Advertising.running_) {
      return;
    }

    if (Bluefruit.Advertising.stop_timeout_s_ != 0U) {
      const unsigned long elapsedMs = millis() - adv_started_ms_;
      if (elapsedMs >= (static_cast<unsigned long>(Bluefruit.Advertising.stop_timeout_s_) *
                        1000UL)) {
        Bluefruit.Advertising.running_ = false;
        if (Bluefruit.Advertising.stop_callback_ != nullptr) {
          Bluefruit.Advertising.stop_callback_();
        }
        return;
      }
    }

    if (Bluefruit.Advertising.dirty_ || Bluefruit.ScanResponse.dirty_) {
      if (!applyAdvertisingPayloads()) {
        return;
      }
    }

    uint16_t intervalUnits = Bluefruit.Advertising.interval_fast_;
    if (Bluefruit.Advertising.fast_timeout_s_ != 0U) {
      const unsigned long elapsedMs = millis() - adv_started_ms_;
      if (elapsedMs >= (static_cast<unsigned long>(Bluefruit.Advertising.fast_timeout_s_) *
                        1000UL)) {
        intervalUnits = (Bluefruit.Advertising.interval_slow_ != 0U)
                            ? Bluefruit.Advertising.interval_slow_
                            : Bluefruit.Advertising.interval_fast_;
      }
    }
    if (intervalUnits == 0U) {
      intervalUnits = 32U;
    }

    const uint32_t nowUs = micros();
    if (next_adv_due_us_ != 0U && !timeReachedUs(nowUs, next_adv_due_us_)) {
      return;
    }

    radio_.advertiseInteractEvent(nullptr);
    next_adv_due_us_ = nowUs + (static_cast<uint32_t>(intervalUnits) * 625UL);
  }

  void handleConnectionEdge(bool connected) {
    if (connected) {
      connection_.handle_ = 0U;
      last_connection_role_ = radio_.connectionRole();
      pending_connect_valid_ = false;
      if (Bluefruit.auto_conn_led_) {
        digitalWrite(LED_BUILTIN, kLedOnState);
      }
      if (last_connection_role_ == BleConnectionRole::kPeripheral) {
        for (uint8_t i = 0U; i < characteristic_count_; ++i) {
          if (characteristics_[i] != nullptr) {
            characteristics_[i]->_notify_enabled = false;
            characteristics_[i]->_indicate_enabled = false;
          }
        }
        if (Bluefruit.Periph.connect_callback_ != nullptr) {
          Bluefruit.Periph.connect_callback_(0U);
        }
        if (!Bluefruit.Advertising.restart_on_disconnect_) {
          Bluefruit.Advertising.running_ = false;
        }
      } else if (last_connection_role_ == BleConnectionRole::kCentral) {
        Bluefruit.Scanner.paused_ = true;
        if (Bluefruit.Central.connect_callback_ != nullptr) {
          Bluefruit.Central.connect_callback_(0U);
        }
      }
      return;
    }

    BleDisconnectDebug debug{};
    uint8_t reason = 0x13U;
    if (radio_.getDisconnectDebug(&debug)) {
      reason = disconnectReasonToHci(debug);
    }
    connection_.handle_ = INVALID_CONNECTION_HANDLE;
    if (last_connection_role_ == BleConnectionRole::kPeripheral) {
      for (uint8_t i = 0U; i < characteristic_count_; ++i) {
        if (characteristics_[i] != nullptr) {
          const bool hadNotify = characteristics_[i]->_notify_enabled;
          const bool hadIndicate = characteristics_[i]->_indicate_enabled;
          characteristics_[i]->_notify_enabled = false;
          characteristics_[i]->_indicate_enabled = false;
          if ((hadNotify || hadIndicate) && characteristics_[i]->_cccd_wr_cb != nullptr) {
            characteristics_[i]->_cccd_wr_cb(0U, characteristics_[i], 0U);
          }
        }
      }
    }
    if (Bluefruit.auto_conn_led_) {
      digitalWrite(LED_BUILTIN, kLedOffState);
    }
    if (last_connection_role_ == BleConnectionRole::kPeripheral) {
      if (Bluefruit.Periph.disconnect_callback_ != nullptr) {
        Bluefruit.Periph.disconnect_callback_(0U, reason);
      }
      if (Bluefruit.Advertising.restart_on_disconnect_) {
        Bluefruit.Advertising.running_ = true;
        adv_started_ms_ = millis();
        next_adv_due_us_ = 0U;
      }
    } else if (last_connection_role_ == BleConnectionRole::kCentral) {
      if (Bluefruit.Central.disconnect_callback_ != nullptr) {
        Bluefruit.Central.disconnect_callback_(0U, reason);
      }
      if (Bluefruit.Scanner.restart_on_disconnect_ && Bluefruit.Scanner.running_) {
        Bluefruit.Scanner.paused_ = false;
      }
    }
    last_connection_role_ = BleConnectionRole::kNone;
  }
};

