lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
BluefruitCompatManager& manager() {
  static BluefruitCompatManager instance;
  return instance;
}

BLEService* BLEService::lastService = nullptr;
BLEClientService* BLEClientService::lastService = nullptr;
AdafruitBluefruit Bluefruit;
const uint8_t BLEUART_UUID_SERVICE[16] = {0x9EU, 0xCAU, 0xDCU, 0x24U, 0x0EU, 0xE5U,
                                          0xA9U, 0xE0U, 0x93U, 0xF3U, 0xA3U, 0xB5U,
                                          0x01U, 0x00U, 0x40U, 0x6EU};
const uint8_t BLEUART_UUID_CHR_RXD[16] = {0x9EU, 0xCAU, 0xDCU, 0x24U, 0x0EU, 0xE5U,
                                          0xA9U, 0xE0U, 0x93U, 0xF3U, 0xA3U, 0xB5U,
                                          0x02U, 0x00U, 0x40U, 0x6EU};
const uint8_t BLEUART_UUID_CHR_TXD[16] = {0x9EU, 0xCAU, 0xDCU, 0x24U, 0x0EU, 0xE5U,
                                          0xA9U, 0xE0U, 0x93U, 0xF3U, 0xA3U, 0xB5U,
                                          0x03U, 0x00U, 0x40U, 0x6EU};

enum class AttWaitOutcome : uint8_t {
  kResponse = 0,
  kError = 1,
  kDisconnected = 2,
  kTimeout = 3,
};

struct AttWaitResult {
  AttWaitOutcome outcome;
  BleConnectionEvent event;
  uint8_t errorCode;
};

bool centralReady(uint16_t connHandle) {
  return connHandle == 0U && manager().radio().isConnected() &&
         manager().radio().connectionRole() == BleConnectionRole::kCentral;
}

bool nextCentralEvent(BleConnectionEvent* event, uint32_t timeoutMs = 800UL) {
  if (event == nullptr) {
    return false;
  }

  const unsigned long startMs = millis();
  while ((millis() - startMs) < timeoutMs) {
    if (manager().radio().consumeDeferredConnectionEvent(event)) {
      return true;
    }
    if (!manager().radio().isConnected()) {
      return false;
    }
    if (manager().radio().pollConnectionEvent(event, 120000UL)) {
      return true;
    }
  }
  return false;
}

AttWaitResult waitForAttOpcode(uint8_t requestOpcode, uint8_t responseOpcode,
                               uint32_t timeoutMs = 1000UL) {
  AttWaitResult result{};
  result.outcome = AttWaitOutcome::kTimeout;
  result.errorCode = 0U;

  const unsigned long startMs = millis();
  while ((millis() - startMs) < timeoutMs) {
    BleConnectionEvent event{};
    if (!nextCentralEvent(&event, 120UL)) {
      if (!manager().radio().isConnected()) {
        result.outcome = AttWaitOutcome::kDisconnected;
        return result;
      }
      continue;
    }

    if (event.terminateInd) {
      result.outcome = AttWaitOutcome::kDisconnected;
      result.event = event;
      return result;
    }

    if (!(event.packetReceived && event.crcOk && event.attPacket &&
          event.payload != nullptr && event.payloadLength >= 5U)) {
      manager().handleCentralConnectionEvent(event);
      continue;
    }

    const uint8_t attOpcode = event.payload[4];
    if (attOpcode == kAttOpHandleValueNtf) {
      manager().handleCentralConnectionEvent(event);
      continue;
    }

    if (attOpcode == kAttOpErrorRsp && event.payloadLength >= 9U) {
      if (event.payload[5] == requestOpcode) {
        result.outcome = AttWaitOutcome::kError;
        result.event = event;
        result.errorCode = event.payload[8];
        return result;
      }
      manager().handleCentralConnectionEvent(event);
      continue;
    }

    if (attOpcode == responseOpcode) {
      result.outcome = AttWaitOutcome::kResponse;
      result.event = event;
      return result;
    }

    manager().handleCentralConnectionEvent(event);
  }

  return result;
}

bool queueServiceDiscoveryRequest(const BLEUuid& uuid) {
  if (uuid.size() == 2U) {
    uint8_t request[9] = {kAttOpFindByTypeValueReq, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U};
    writeLe16(&request[1], 0x0001U);
    writeLe16(&request[3], 0xFFFFU);
    writeLe16(&request[5], kUuidPrimaryService);
    writeLe16(&request[7], uuid.uuid16());
    return manager().radio().queueAttRequest(request, sizeof(request));
  }
  if (uuid.size() == 16U) {
    uint8_t request[23] = {0};
    request[0] = kAttOpFindByTypeValueReq;
    writeLe16(&request[1], 0x0001U);
    writeLe16(&request[3], 0xFFFFU);
    writeLe16(&request[5], kUuidPrimaryService);
    memcpy(&request[7], uuid.uuid128(), 16U);
    return manager().radio().queueAttRequest(request, sizeof(request));
  }
  return false;
}

bool discoverServiceRangeSync(const BLEUuid& uuid, uint16_t* startHandle,
                              uint16_t* endHandle) {
  if (startHandle == nullptr || endHandle == nullptr || !queueServiceDiscoveryRequest(uuid)) {
    return false;
  }

  const AttWaitResult wait =
      waitForAttOpcode(kAttOpFindByTypeValueReq, kAttOpFindByTypeValueRsp);
  if (wait.outcome != AttWaitOutcome::kResponse || wait.event.payloadLength < 9U) {
    return false;
  }

  *startHandle = readLe16(&wait.event.payload[5]);
  *endHandle = readLe16(&wait.event.payload[7]);
  return (*startHandle != 0U) && (*endHandle >= *startHandle);
}

bool discoverCharacteristicSync(uint16_t serviceStartHandle, uint16_t serviceEndHandle,
                                const BLEUuid& uuid, uint16_t* declHandle,
                                uint16_t* valueHandle, uint16_t* endHandle) {
  if (declHandle == nullptr || valueHandle == nullptr || endHandle == nullptr ||
      serviceStartHandle == 0U || serviceEndHandle == 0U) {
    return false;
  }

  bool found = false;
  uint16_t searchStart = serviceStartHandle;
  *declHandle = 0U;
  *valueHandle = 0U;
  *endHandle = 0U;

  while (searchStart <= serviceEndHandle) {
    uint8_t request[7] = {kAttOpReadByTypeReq, 0U, 0U, 0U, 0U, 0U, 0U};
    writeLe16(&request[1], searchStart);
    writeLe16(&request[3], serviceEndHandle);
    writeLe16(&request[5], kUuidCharacteristic);
    if (!manager().radio().queueAttRequest(request, sizeof(request))) {
      return false;
    }

    const AttWaitResult wait =
        waitForAttOpcode(kAttOpReadByTypeReq, kAttOpReadByTypeRsp);
    if (wait.outcome == AttWaitOutcome::kError &&
        wait.errorCode == kAttErrAttributeNotFound) {
      break;
    }
    if (wait.outcome != AttWaitOutcome::kResponse || wait.event.payloadLength < 7U) {
      return false;
    }

