lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
BLEAdvertisingData::BLEAdvertisingData(bool scan_response)
    : data_{0}, len_(0U), scan_response_(scan_response), dirty_(true) {}

void BLEAdvertisingData::clearData() {
  memset(data_, 0, sizeof(data_));
  len_ = 0U;
  dirty_ = true;
}

bool BLEAdvertisingData::setData(const uint8_t* data, uint8_t len) {
  if ((data == nullptr && len > 0U) || len > sizeof(data_)) {
    return false;
  }
  memset(data_, 0, sizeof(data_));
  if (len > 0U) {
    memcpy(data_, data, len);
  }
  len_ = len;
  dirty_ = true;
  return true;
}

bool BLEAdvertisingData::addData(uint8_t type, const void* data, uint8_t len) {
  if ((data == nullptr && len > 0U) || (len_ + len + 2U) > sizeof(data_)) {
    return false;
  }
  data_[len_++] = static_cast<uint8_t>(len + 1U);
  data_[len_++] = type;
  if (len > 0U) {
    memcpy(&data_[len_], data, len);
    len_ = static_cast<uint8_t>(len_ + len);
  }
  dirty_ = true;
  return true;
}

bool BLEAdvertisingData::addFlags(uint8_t flags) { return addData(kAdTypeFlags, &flags, 1U); }

bool BLEAdvertisingData::addTxPower() {
  const int8_t txPower = Bluefruit.getTxPower();
  return addData(kAdTypeTxPower, &txPower, 1U);
}

bool BLEAdvertisingData::addName() {
  char name[CFG_MAX_DEVNAME_LEN + 1] = {0};
  const uint8_t nameLen = Bluefruit.getName(name, sizeof(name));
  if (nameLen == 0U) {
    return false;
  }
  const uint8_t maxLen = static_cast<uint8_t>((sizeof(data_) > (len_ + 2U))
                                                  ? (sizeof(data_) - len_ - 2U)
                                                  : 0U);
  if (maxLen == 0U) {
    return false;
  }
  const uint8_t actualLen = (nameLen > maxLen) ? maxLen : nameLen;
  const uint8_t type = (actualLen == nameLen) ? kAdTypeCompleteName : kAdTypeShortName;
  return addData(type, name, actualLen);
}

bool BLEAdvertisingData::addAppearance(uint16_t appearance) {
  return addData(kAdTypeAppearance, &appearance, sizeof(appearance));
}

bool BLEAdvertisingData::addManufacturerData(const void* data, uint8_t len) {
  return addData(kAdTypeManufacturer, data, len);
}

bool BLEAdvertisingData::addService(const BLEService& service) { return addService(service.uuid); }

bool BLEAdvertisingData::addService(const BLEClientService& service) {
  return addService(service.uuid);
}

bool BLEAdvertisingData::addService(const BLEService& service1, const BLEService& service2) {
  return addService(service1) && addService(service2);
}

bool BLEAdvertisingData::addService(const BLEService& service1, const BLEService& service2,
                                    const BLEService& service3) {
  return addService(service1) && addService(service2) && addService(service3);
}

bool BLEAdvertisingData::addService(const BLEService& service1, const BLEService& service2,
                                    const BLEService& service3,
                                    const BLEService& service4) {
  return addService(service1) && addService(service2) && addService(service3) &&
         addService(service4);
}

bool BLEAdvertisingData::addService(const BLEUuid& uuid) { return addUuid(uuid); }

bool BLEAdvertisingData::addUuid(const BLEUuid& uuid) {
  if (uuid.size() == 2U) {
    const uint16_t uuid16 = uuid.uuid16();
    return addData(kAdTypeComplete16, &uuid16, sizeof(uuid16));
  }
  if (uuid.size() == 16U) {
    return addData(kAdTypeComplete128, uuid.uuid128(), 16U);
  }
  return false;
}

bool BLEAdvertisingData::addUuid(const BLEUuid& uuid1, const BLEUuid& uuid2) {
  return addUuid(uuid1) && addUuid(uuid2);
}

bool BLEAdvertisingData::addUuid(const BLEUuid& uuid1, const BLEUuid& uuid2,
                                 const BLEUuid& uuid3) {
  return addUuid(uuid1) && addUuid(uuid2) && addUuid(uuid3);
}

bool BLEAdvertisingData::addUuid(const BLEUuid& uuid1, const BLEUuid& uuid2,
                                 const BLEUuid& uuid3, const BLEUuid& uuid4) {
  return addUuid(uuid1) && addUuid(uuid2) && addUuid(uuid3) && addUuid(uuid4);
}

bool BLEAdvertisingData::addUuid(const BLEUuid uuids[], uint8_t count) {
  if (uuids == nullptr) {
    return false;
  }
  for (uint8_t i = 0U; i < count; ++i) {
    if (!addUuid(uuids[i])) {
      return false;
    }
  }
  return true;
}

uint8_t BLEAdvertisingData::count() const { return len_; }

uint8_t* BLEAdvertisingData::getData() { return data_; }

BLEAdvertising::BLEAdvertising()
    : BLEAdvertisingData(false),
      restart_on_disconnect_(true),
      interval_fast_(32U),
      interval_slow_(244U),
      fast_timeout_s_(30U),
      stop_timeout_s_(0U),
      adv_type_(static_cast<uint8_t>(xiao_nrf54l15::BleAdvPduType::kAdvInd)),
      running_(false),
      slow_callback_(nullptr),
      stop_callback_(nullptr) {}

void BLEAdvertising::restartOnDisconnect(bool enable) { restart_on_disconnect_ = enable; }

void BLEAdvertising::setInterval(uint16_t fast, uint16_t slow) {
  interval_fast_ = fast;
  interval_slow_ = slow;
}

void BLEAdvertising::setIntervalMS(uint16_t fast_ms, uint16_t slow_ms) {
  setInterval(MS1000TO625(fast_ms), (slow_ms == 0U) ? 0U : MS1000TO625(slow_ms));
}

void BLEAdvertising::setFastTimeout(uint16_t seconds) { fast_timeout_s_ = seconds; }

void BLEAdvertising::setType(uint8_t type) { adv_type_ = type; }

void BLEAdvertising::setSlowCallback(slow_callback_t cb) { slow_callback_ = cb; }

void BLEAdvertising::setStopCallback(stop_callback_t cb) { stop_callback_ = cb; }

uint16_t BLEAdvertising::getInterval() const { return interval_fast_; }

bool BLEAdvertising::setBeacon(BLEBeacon& beacon) { return beacon.start(*this); }

bool BLEAdvertising::setBeacon(EddyStoneUrl& beacon) { return beacon.start(*this); }

bool BLEAdvertising::start(uint16_t timeout) {
  if (!manager().begin(1U, 0U)) {
    return false;
  }
  stop_timeout_s_ = timeout;
  running_ = true;
  manager().markAdvertisingDirty();
  manager().advertisingStarted();
  return true;
}

bool BLEAdvertising::stop() {
  running_ = false;
  return true;
}

bool BLEAdvertising::isRunning() const { return running_; }

BLEBeacon::BLEBeacon() { reset(); }

BLEBeacon::BLEBeacon(const uint8_t uuid128[16]) {
  reset();
  setUuid(uuid128);
}

BLEBeacon::BLEBeacon(const uint8_t uuid128[16], uint16_t major, uint16_t minor, int8_t rssi) {
  reset();
  setUuid(uuid128);
  setMajorMinor(major, minor);
  setRssiAt1m(rssi);
}

void BLEBeacon::reset() {
  manufacturer_ = kCompanyIdApple;
  memset(uuid128_, 0, sizeof(uuid128_));
  uuid_valid_ = false;
  major_be_ = 0U;
  minor_be_ = 0U;
  rssi_at_1m_ = -54;
}

