lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
void BLECentral::setDisconnectCallback(ble_disconnect_callback_t fp) {
  disconnect_callback_ = fp;
}

bool BLECentral::connect(const ble_gap_evt_adv_report_t* report) {
  if (!manager().begin(0U, 1U)) {
    return false;
  }
  return manager().queueCentralConnect(report);
}

bool BLECentral::connected() const {
  return manager().radio().isConnected() &&
         manager().radio().connectionRole() == BleConnectionRole::kCentral;
}

void BLECentral::clearBonds() {
  (void)manager().radio().clearBondRecord();
}

BLEScanner::BLEScanner()
    : rx_callback_(nullptr),
      interval_(160U),
      window_(80U),
      timeout_s_(0U),
      active_scan_(false),
      restart_on_disconnect_(false),
      running_(false),
      paused_(false),
      has_filter_uuid_(false),
      filter_uuid_(),
      has_filter_msd_(false),
      filter_msd_company_(0U),
      has_filter_rssi_(false),
      filter_rssi_dbm_(-127) {}

void BLEScanner::setRxCallback(rx_callback_t fp) { rx_callback_ = fp; }

void BLEScanner::setInterval(uint16_t interval, uint16_t window) {
  interval_ = interval;
  window_ = (window == 0U) ? interval : window;
}

void BLEScanner::useActiveScan(bool enabled) { active_scan_ = enabled; }

void BLEScanner::restartOnDisconnect(bool enabled) { restart_on_disconnect_ = enabled; }

void BLEScanner::filterUuid(const BLEUuid& uuid) {
  filter_uuid_ = uuid;
  has_filter_uuid_ = uuid.begin();
}

void BLEScanner::filterService(const BLEUuid& uuid) { filterUuid(uuid); }

void BLEScanner::filterService(const BLEClientService& service) { filterUuid(service.uuid); }

void BLEScanner::filterMSD(uint16_t company_id) {
  filter_msd_company_ = company_id;
  has_filter_msd_ = true;
}

void BLEScanner::filterRssi(int8_t min_rssi_dbm) {
  filter_rssi_dbm_ = min_rssi_dbm;
  has_filter_rssi_ = true;
}

void BLEScanner::start(uint16_t timeout) {
  if (!manager().begin(0U, 1U)) {
    return;
  }
  timeout_s_ = timeout;
  running_ = true;
  paused_ = false;
}

void BLEScanner::resume() { paused_ = false; }

bool BLEScanner::checkReportForUuid(const ble_gap_evt_adv_report_t* report,
                                    const BLEUuid& uuid) const {
  return report != nullptr && adDataHasUuid(report->data.p_data, report->data.len, uuid);
}

bool BLEScanner::checkReportForUuid(const ble_gap_evt_adv_report_t* report,
                                    const uint8_t uuid128[16]) const {
  return (uuid128 != nullptr) && checkReportForUuid(report, BLEUuid(uuid128));
}

bool BLEScanner::checkReportForService(const ble_gap_evt_adv_report_t* report,
                                       const BLEUuid& uuid) const {
  return checkReportForUuid(report, uuid);
}

bool BLEScanner::checkReportForService(const ble_gap_evt_adv_report_t* report,
                                       const BLEClientService& service) const {
  return checkReportForService(report, service.uuid);
}

bool BLEScanner::checkReportForService(const ble_gap_evt_adv_report_t* report,
                                       const BLEClientUart& client_uart) const {
  return checkReportForService(report, client_uart.serviceUuid());
}

int BLEScanner::parseReportByType(const ble_gap_evt_adv_report_t* report, uint8_t type,
                                  void* buffer, uint8_t buffer_len) const {
  if (report == nullptr) {
    return 0;
  }
  return copyAdFieldByType(report->data.p_data, report->data.len, type, buffer, buffer_len);
}

BLEClientCharacteristic::BLEClientCharacteristic()
    : uuid(),
      begun_(false),
      discovered_(false),
      notify_callback_(nullptr),
      service_(nullptr),
      conn_handle_(INVALID_CONNECTION_HANDLE),
      decl_handle_(0U),
      value_handle_(0U),
      end_handle_(0U),
      cccd_handle_(0U),
      last_value_{0},
      last_value_len_(0U) {}

BLEClientCharacteristic::BLEClientCharacteristic(BLEUuid bleuuid)
    : BLEClientCharacteristic() {
  uuid = bleuuid;
}

bool BLEClientCharacteristic::begin() {
  return begin(nullptr);
}

bool BLEClientCharacteristic::begin(BLEClientService* parent_service) {
  if (begun_) {
    return true;
  }
  if (!manager().begin(0U, 1U)) {
    return false;
  }
  service_ = (parent_service != nullptr) ? parent_service : BLEClientService::lastService;
  if (service_ == nullptr || !manager().registerClientCharacteristic(this)) {
    return false;
  }
  begun_ = true;
  return true;
}

BLEClientService& BLEClientCharacteristic::parentService() { return *service_; }

const BLEClientService& BLEClientCharacteristic::parentService() const { return *service_; }

void BLEClientCharacteristic::resetDiscovery() {
  discovered_ = false;
  conn_handle_ = INVALID_CONNECTION_HANDLE;
  decl_handle_ = 0U;
  value_handle_ = 0U;
  end_handle_ = 0U;
  cccd_handle_ = 0U;
  last_value_len_ = 0U;
}

bool BLEClientCharacteristic::discover(uint16_t conn_hdl) {
  if (!begin() || service_ == nullptr || !service_->discover(conn_hdl)) {
    resetDiscovery();
    return false;
  }
  return discover();
}

bool BLEClientCharacteristic::discover() {
  if (!begin() || service_ == nullptr || !service_->discovered_) {
    resetDiscovery();
    return false;
  }

  resetDiscovery();
  if (!discoverCharacteristicSync(service_->start_handle_, service_->end_handle_, uuid,
                                  &decl_handle_, &value_handle_, &end_handle_)) {
    return false;
  }
  conn_handle_ = service_->conn_handle_;
  discovered_ = true;
  return true;
}

uint16_t BLEClientCharacteristic::read(void* buffer, uint16_t len) {
  if (!discovered_ || buffer == nullptr || len == 0U) {
    return 0U;
  }
  uint8_t scratch[sizeof(last_value_)] = {0};
  const uint16_t readLen = readHandleSync(value_handle_, scratch, sizeof(scratch));
  if (readLen == 0U) {
    return 0U;
  }
  last_value_len_ =
      static_cast<uint8_t>(min<uint16_t>(readLen, sizeof(last_value_)));
  memcpy(last_value_, scratch, last_value_len_);
  const uint16_t copyLen = min<uint16_t>(len, readLen);
  memcpy(buffer, scratch, copyLen);
  return copyLen;
}

uint8_t BLEClientCharacteristic::read8() {
  uint8_t value = 0U;
  (void)read(&value, sizeof(value));
  return value;
}

uint16_t BLEClientCharacteristic::write(const void* buffer, uint16_t len) {
  if (!discovered_ || buffer == nullptr || len == 0U) {
    return 0U;
  }
  return writeHandleSync(value_handle_, static_cast<const uint8_t*>(buffer), len, true) ? len
                                                                                          : 0U;
}

