lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
bool BLEClientBas::begin() {
  return BLEClientService::begin() && battery_.begin();
}

bool BLEClientBas::discover(uint16_t conn_hdl) {
  if (!begin() || !BLEClientService::discover(conn_hdl)) {
    return false;
  }
  (void)battery_.discover();
  return true;
}

uint8_t BLEClientBas::read() {
  return battery_.discovered() ? battery_.read8() : 0U;
}

BLEClientCts::BLEClientCts()
    : BLEClientService(UUID16_SVC_CURRENT_TIME),
      current_time_(UUID16_CHR_CURRENT_TIME),
      local_info_(UUID16_CHR_LOCAL_TIME_INFORMATION),
      adjust_callback_(nullptr),
      Time{},
      LocalInfo{} {}

bool BLEClientCts::begin() {
  current_time_.setNotifyCallback(currentTimeNotifyThunk);
  return BLEClientService::begin() && current_time_.begin(this) && local_info_.begin(this);
}

bool BLEClientCts::discover(uint16_t conn_hdl) {
  if (!begin() || !BLEClientService::discover(conn_hdl)) {
    return false;
  }
  (void)current_time_.discover();
  (void)local_info_.discover();
  return current_time_.discovered();
}

bool BLEClientCts::getCurrentTime() {
  return current_time_.discovered() &&
         current_time_.read(&Time, sizeof(Time)) == sizeof(Time);
}

bool BLEClientCts::getLocalTimeInfo() {
  if (!local_info_.discovered()) {
    memset(&LocalInfo, 0, sizeof(LocalInfo));
    return false;
  }
  return local_info_.read(&LocalInfo, sizeof(LocalInfo)) == sizeof(LocalInfo);
}

bool BLEClientCts::enableAdjust() { return current_time_.enableNotify(); }

void BLEClientCts::handleCurrentTimeNotify(uint8_t* data, uint16_t len) {
  if (data == nullptr || len == 0U) {
    return;
  }
  const uint16_t copyLen = min<uint16_t>(len, sizeof(Time));
  memcpy(&Time, data, copyLen);
  if (copyLen < sizeof(Time)) {
    memset(reinterpret_cast<uint8_t*>(&Time) + copyLen, 0, sizeof(Time) - copyLen);
  }
  if (adjust_callback_ != nullptr) {
    adjust_callback_(Time.adjust_reason);
  }
}

void BLEClientCts::currentTimeNotifyThunk(BLEClientCharacteristic* chr, uint8_t* data,
                                          uint16_t len) {
  if (chr == nullptr) {
    return;
  }
  static_cast<BLEClientCts&>(chr->parentService()).handleCurrentTimeNotify(data, len);
}

namespace {
const uint8_t kAncsServiceUuid[16] = {0xD0U, 0x00U, 0x2DU, 0x12U, 0x1EU, 0x4BU, 0x0FU, 0xA4U,
                                      0x99U, 0x4EU, 0xCEU, 0xB5U, 0x31U, 0xF4U, 0x05U, 0x79U};
const uint8_t kAncsControlUuid[16] = {0xD9U, 0xD9U, 0xAAU, 0xFDU, 0xBDU, 0x9BU, 0x21U, 0x98U,
                                      0xA8U, 0x49U, 0xE1U, 0x45U, 0xF3U, 0xD8U, 0xD1U, 0x69U};
const uint8_t kAncsNotificationUuid[16] = {0xBDU, 0x1DU, 0xA2U, 0x99U, 0xE6U, 0x25U, 0x58U, 0x8CU,
                                           0xD9U, 0x42U, 0x01U, 0x63U, 0x0DU, 0x12U, 0xBFU, 0x9FU};
const uint8_t kAncsDataUuid[16] = {0xFBU, 0x7BU, 0x7CU, 0xCEU, 0x6AU, 0xB3U, 0x44U, 0xBEU,
                                   0xB5U, 0x4BU, 0xD6U, 0x24U, 0xE9U, 0xC6U, 0xEAU, 0x22U};
}  // namespace

BLEAncs::BLEAncs()
    : BLEClientService(kAncsServiceUuid),
      control_(kAncsControlUuid),
      notification_(kAncsNotificationUuid),
      data_(kAncsDataUuid),
      notification_callback_(nullptr) {}

bool BLEAncs::begin() {
  notification_.setNotifyCallback(notificationThunk);
  data_.setNotifyCallback(dataThunk);
  return BLEClientService::begin() && control_.begin(this) && notification_.begin(this) &&
         data_.begin(this);
}

bool BLEAncs::discover(uint16_t conn_handle) {
  if (!begin() || !BLEClientService::discover(conn_handle)) {
    return false;
  }
  const bool foundControl = control_.discover();
  const bool foundNotification = notification_.discover();
  const bool foundData = data_.discover();
  return foundControl && foundNotification && foundData;
}

void BLEAncs::setNotificationCallback(notification_callback_t fp) {
  notification_callback_ = fp;
}

bool BLEAncs::enableNotification() {
  return data_.enableNotify() && notification_.enableNotify();
}

bool BLEAncs::disableNotification() {
  bool ok = true;
  if (notification_.discovered()) {
    ok = notification_.disableNotify() && ok;
  }
  if (data_.discovered()) {
    ok = data_.disableNotify() && ok;
  }
  return ok;
}

uint16_t BLEAncs::getAttribute(uint32_t uid, uint8_t attr, void* buffer, uint16_t bufsize) {
  (void)uid;
  (void)attr;
  if (buffer != nullptr && bufsize > 0U) {
    memset(buffer, 0, bufsize);
  }
  return 0U;
}

uint16_t BLEAncs::getAppAttribute(const char* appid, uint8_t attr, void* buffer,
                                  uint16_t bufsize) {
  (void)appid;
  (void)attr;
  if (buffer != nullptr && bufsize > 0U) {
    memset(buffer, 0, bufsize);
  }
  return 0U;
}

bool BLEAncs::performAction(uint32_t uid, uint8_t actionid) {
  if (!control_.discovered()) {
    return false;
  }
  uint8_t payload[6] = {ANCS_CMD_PERFORM_NOTIFICATION_ACTION, 0U, 0U, 0U, 0U, actionid};
  memcpy(&payload[1], &uid, sizeof(uid));
  return control_.write(payload, sizeof(payload)) == sizeof(payload);
}

uint16_t BLEAncs::getAppName(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAppAttribute("", ANCS_APP_ATTR_DISPLAY_NAME, buffer, bufsize);
}

uint16_t BLEAncs::getAppID(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_APP_IDENTIFIER, buffer, bufsize);
}

uint16_t BLEAncs::getTitle(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_TITLE, buffer, bufsize);
}

uint16_t BLEAncs::getSubtitle(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_SUBTITLE, buffer, bufsize);
}

uint16_t BLEAncs::getMessage(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_MESSAGE, buffer, bufsize);
}

uint16_t BLEAncs::getMessageSize(uint32_t uid) {
  uint16_t value = 0U;
  (void)getAttribute(uid, ANCS_ATTR_MESSAGE_SIZE, &value, sizeof(value));
  return value;
}

uint16_t BLEAncs::getDate(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_DATE, buffer, bufsize);
}

uint16_t BLEAncs::getPosActionLabel(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_POSITIVE_ACTION_LABEL, buffer, bufsize);
}

uint16_t BLEAncs::getNegActionLabel(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_NEGATIVE_ACTION_LABEL, buffer, bufsize);
}

bool BLEAncs::actPositive(uint32_t uid) { return performAction(uid, ANCS_ACTION_POSITIVE); }

bool BLEAncs::actNegative(uint32_t uid) { return performAction(uid, ANCS_ACTION_NEGATIVE); }

