lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
void BLEAncs::handleNotification(uint8_t* data, uint16_t len) {
  if (notification_callback_ == nullptr || data == nullptr || len < sizeof(AncsNotification_t)) {
    return;
  }
  notification_callback_(reinterpret_cast<AncsNotification_t*>(data));
}

void BLEAncs::notificationThunk(BLEClientCharacteristic* chr, uint8_t* data, uint16_t len) {
  if (chr == nullptr) {
    return;
  }
  static_cast<BLEAncs&>(chr->parentService()).handleNotification(data, len);
}

void BLEAncs::dataThunk(BLEClientCharacteristic* chr, uint8_t* data, uint16_t len) {
  (void)chr;
  (void)data;
  (void)len;
}

BLEClientHidAdafruit::BLEClientHidAdafruit()
    : BLEClientService(UUID16_SVC_HUMAN_INTERFACE_DEVICE),
      keyboard_callback_(nullptr),
      mouse_callback_(nullptr),
      gamepad_callback_(nullptr),
      last_keyboard_report_{0},
      last_mouse_report_{0},
      last_gamepad_report_{0},
      protocol_mode_(UUID16_CHR_PROTOCOL_MODE),
      hid_info_(UUID16_CHR_HID_INFORMATION),
      hid_control_(UUID16_CHR_HID_CONTROL_POINT),
      keyboard_boot_input_(UUID16_CHR_BOOT_KEYBOARD_INPUT_REPORT),
      keyboard_boot_output_(UUID16_CHR_BOOT_KEYBOARD_OUTPUT_REPORT),
      mouse_boot_input_(UUID16_CHR_BOOT_MOUSE_INPUT_REPORT),
      gamepad_report_(UUID16_CHR_REPORT) {}

bool BLEClientHidAdafruit::begin() {
  keyboard_boot_input_.setNotifyCallback(keyboardNotifyThunk);
  mouse_boot_input_.setNotifyCallback(mouseNotifyThunk);
  gamepad_report_.setNotifyCallback(gamepadNotifyThunk);
  return BLEClientService::begin() && protocol_mode_.begin(this) && hid_info_.begin(this) &&
         hid_control_.begin(this) && keyboard_boot_input_.begin(this) &&
         keyboard_boot_output_.begin(this) && mouse_boot_input_.begin(this) &&
         gamepad_report_.begin(this);
}

bool BLEClientHidAdafruit::discover(uint16_t conn_handle) {
  if (!begin() || !BLEClientService::discover(conn_handle)) {
    return false;
  }
  (void)protocol_mode_.discover();
  (void)hid_info_.discover();
  (void)hid_control_.discover();
  (void)keyboard_boot_input_.discover();
  (void)keyboard_boot_output_.discover();
  (void)mouse_boot_input_.discover();
  (void)gamepad_report_.discover();
  return hid_info_.discovered() && hid_control_.discovered() &&
         (keyboardPresent() || mousePresent() || gamepadPresent());
}

bool BLEClientHidAdafruit::getHidInfo(uint8_t info[4]) {
  return (info != nullptr) && (hid_info_.read(info, 4U) == 4U);
}

uint8_t BLEClientHidAdafruit::getCountryCode(void) {
  uint8_t info[4] = {0};
  return getHidInfo(info) ? info[2] : 0U;
}

bool BLEClientHidAdafruit::setBootMode(bool boot) {
  return protocol_mode_.discovered() && protocol_mode_.write8(boot ? 0U : 1U) == 1U;
}

bool BLEClientHidAdafruit::keyboardPresent(void) {
  return keyboard_boot_input_.discovered() && keyboard_boot_output_.discovered() &&
         protocol_mode_.discovered();
}

bool BLEClientHidAdafruit::enableKeyboard(void) { return keyboard_boot_input_.enableNotify(); }

bool BLEClientHidAdafruit::disableKeyboard(void) { return keyboard_boot_input_.disableNotify(); }

void BLEClientHidAdafruit::getKeyboardReport(hid_keyboard_report_t* report) {
  if (report != nullptr) {
    memcpy(report, &last_keyboard_report_, sizeof(last_keyboard_report_));
  }
}

bool BLEClientHidAdafruit::mousePresent(void) {
  return mouse_boot_input_.discovered() && protocol_mode_.discovered();
}

bool BLEClientHidAdafruit::enableMouse(void) { return mouse_boot_input_.enableNotify(); }

bool BLEClientHidAdafruit::disableMouse(void) { return mouse_boot_input_.disableNotify(); }

void BLEClientHidAdafruit::getMouseReport(hid_mouse_report_t* report) {
  if (report != nullptr) {
    memcpy(report, &last_mouse_report_, sizeof(last_mouse_report_));
  }
}

bool BLEClientHidAdafruit::gamepadPresent(void) { return gamepad_report_.discovered(); }

bool BLEClientHidAdafruit::enableGamepad(void) { return gamepad_report_.enableNotify(); }

bool BLEClientHidAdafruit::disableGamepad(void) { return gamepad_report_.disableNotify(); }

void BLEClientHidAdafruit::getGamepadReport(hid_gamepad_report_t* report) {
  if (report != nullptr) {
    memcpy(report, &last_gamepad_report_, sizeof(last_gamepad_report_));
  }
}

void BLEClientHidAdafruit::setKeyboardReportCallback(kbd_callback_t fp) {
  keyboard_callback_ = fp;
}

void BLEClientHidAdafruit::setMouseReportCallback(mse_callback_t fp) {
  mouse_callback_ = fp;
}

void BLEClientHidAdafruit::setGamepadReportCallback(gpd_callback_t fp) {
  gamepad_callback_ = fp;
}

void BLEClientHidAdafruit::handleKeyboardInput(uint8_t* data, uint16_t len) {
  memset(&last_keyboard_report_, 0, sizeof(last_keyboard_report_));
  if (data != nullptr) {
    memcpy(&last_keyboard_report_, data, min<uint16_t>(len, sizeof(last_keyboard_report_)));
  }
  if (keyboard_callback_ != nullptr) {
    keyboard_callback_(&last_keyboard_report_);
  }
}

void BLEClientHidAdafruit::handleMouseInput(uint8_t* data, uint16_t len) {
  memset(&last_mouse_report_, 0, sizeof(last_mouse_report_));
  if (data != nullptr) {
    memcpy(&last_mouse_report_, data, min<uint16_t>(len, sizeof(last_mouse_report_)));
  }
  if (mouse_callback_ != nullptr) {
    mouse_callback_(&last_mouse_report_);
  }
}

void BLEClientHidAdafruit::handleGamepadInput(uint8_t* data, uint16_t len) {
  memset(&last_gamepad_report_, 0, sizeof(last_gamepad_report_));
  if (data != nullptr) {
    memcpy(&last_gamepad_report_, data, min<uint16_t>(len, sizeof(last_gamepad_report_)));
  }
  if (gamepad_callback_ != nullptr) {
    gamepad_callback_(&last_gamepad_report_);
  }
}

void BLEClientHidAdafruit::keyboardNotifyThunk(BLEClientCharacteristic* chr, uint8_t* data,
                                               uint16_t len) {
  if (chr != nullptr) {
    static_cast<BLEClientHidAdafruit&>(chr->parentService()).handleKeyboardInput(data, len);
  }
}

void BLEClientHidAdafruit::mouseNotifyThunk(BLEClientCharacteristic* chr, uint8_t* data,
                                            uint16_t len) {
  if (chr != nullptr) {
    static_cast<BLEClientHidAdafruit&>(chr->parentService()).handleMouseInput(data, len);
  }
}

void BLEClientHidAdafruit::gamepadNotifyThunk(BLEClientCharacteristic* chr, uint8_t* data,
                                              uint16_t len) {
  if (chr != nullptr) {
    static_cast<BLEClientHidAdafruit&>(chr->parentService()).handleGamepadInput(data, len);
  }
}

BLEHidAdafruit::BLEHidAdafruit()
    : BLEService(UUID16_SVC_HUMAN_INTERFACE_DEVICE),
      mouse_buttons_(0U),
      keyboard_led_callback_(nullptr) {}

err_t BLEHidAdafruit::begin() { return BLEService::begin(); }

