lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
void BLEDis::setPNPID(const char* pnp_id, uint8_t length) {
  values_[8] = pnp_id;
  lengths_[8] = length;
}

err_t BLEDis::begin() {
  static const uint16_t kCharacteristicUuids[9] = {
      UUID16_CHR_SYSTEM_ID,        UUID16_CHR_MODEL_NUMBER_STRING,
      UUID16_CHR_SERIAL_NUMBER_STRING, UUID16_CHR_FIRMWARE_REVISION_STRING,
      UUID16_CHR_HARDWARE_REVISION_STRING, UUID16_CHR_SOFTWARE_REVISION_STRING,
      UUID16_CHR_MANUFACTURER_NAME_STRING, UUID16_CHR_REGULATORY_CERT_DATA_LIST,
      UUID16_CHR_PNP_ID};

  const err_t status = BLEService::begin();
  if (status != ERROR_NONE) {
    return status;
  }

  for (uint8_t i = 0U; i < 9U; ++i) {
    if (values_[i] == nullptr || lengths_[i] == 0U) {
      continue;
    }
    const uint8_t len = clampValueLen(lengths_[i]);
    if (!manager().radio().addCustomGattCharacteristic(
            _handle, kCharacteristicUuids[i], xiao_nrf54l15::kBleGattPropRead,
            reinterpret_cast<const uint8_t*>(values_[i]), len, nullptr, nullptr)) {
      return ERROR_INVALID_STATE;
    }
  }
  return ERROR_NONE;
}

BLEDfu::BLEDfu() : BLEService(kUuidDfuService) {}

err_t BLEDfu::begin() {
  _begun = true;
  lastService = this;
  return ERROR_NONE;
}

BLEBas::BLEBas() : BLEService(UUID16_SVC_BATTERY) {}

err_t BLEBas::begin() {
  _begun = true;
  lastService = this;
  return ERROR_NONE;
}

bool BLEBas::write(uint8_t level) { return manager().radio().setGattBatteryLevel(level); }

bool BLEBas::notify(uint8_t level) { return notify(0U, level); }

bool BLEBas::notify(uint16_t conn_hdl, uint8_t level) {
  (void)conn_hdl;
  return write(level);
}

BLEUart::BLEUart(uint16_t fifo_depth)
    : BLEService(BLEUART_UUID_SERVICE),
      _txd(BLEUART_UUID_CHR_TXD),
      _rxd(BLEUART_UUID_CHR_RXD),
      _rx_fifo_depth((fifo_depth == 0U) ? 1U : fifo_depth),
      _rx_fifo(new uint8_t[(fifo_depth == 0U) ? 1U : fifo_depth]),
      _rx_head(0U),
      _rx_tail(0U),
      _rx_count(0U),
      _tx_buffered(false),
      _rx_cb(nullptr),
      _notify_cb(nullptr),
      _overflow_cb(nullptr) {}

err_t BLEUart::begin() {
  const err_t status = BLEService::begin();
  if (status != ERROR_NONE) {
    return status;
  }

  _txd.setProperties(CHR_PROPS_NOTIFY);
  _txd.setPermission(SECMODE_OPEN, SECMODE_NO_ACCESS);
  _txd.setMaxLen(BleRadio::kCustomGattMaxValueLength);
  _txd.setCccdWriteCallback(bleuart_txd_cccd_cb);
  if (_txd.begin() != ERROR_NONE) {
    return ERROR_INVALID_STATE;
  }

  _rxd.setProperties(CHR_PROPS_WRITE | CHR_PROPS_WRITE_WO_RESP);
  _rxd.setPermission(SECMODE_NO_ACCESS, SECMODE_OPEN);
  _rxd.setMaxLen(BleRadio::kCustomGattMaxValueLength);
  _rxd.setWriteCallback(bleuart_rxd_cb);
  if (_rxd.begin() != ERROR_NONE) {
    return ERROR_INVALID_STATE;
  }

  return ERROR_NONE;
}

bool BLEUart::notifyEnabled() { return _txd.notifyEnabled(); }

bool BLEUart::notifyEnabled(uint16_t conn_hdl) { return _txd.notifyEnabled(conn_hdl); }

void BLEUart::setRxCallback(rx_callback_t fp, bool deferred) {
  (void)deferred;
  _rx_cb = fp;
}

void BLEUart::setRxOverflowCallback(rx_overflow_callback_t fp) { _overflow_cb = fp; }

void BLEUart::setNotifyCallback(notify_callback_t fp) { _notify_cb = fp; }

void BLEUart::bufferTXD(bool enable) { _tx_buffered = enable; }

bool BLEUart::flushTXD() { return flushTXD(0U); }

bool BLEUart::flushTXD(uint16_t conn_hdl) {
  (void)conn_hdl;
  return true;
}

uint8_t BLEUart::read8() { return static_cast<uint8_t>(read()); }

uint16_t BLEUart::read16() {
  uint16_t value = 0U;
  read(reinterpret_cast<uint8_t*>(&value), sizeof(value));
  return value;
}

uint32_t BLEUart::read32() {
  uint32_t value = 0UL;
  read(reinterpret_cast<uint8_t*>(&value), sizeof(value));
  return value;
}

int BLEUart::read() {
  if (_rx_count == 0U) {
    return -1;
  }
  const int value = _rx_fifo[_rx_tail];
  _rx_tail = static_cast<uint16_t>((_rx_tail + 1U) % _rx_fifo_depth);
  --_rx_count;
  return value;
}

int BLEUart::read(uint8_t* buf, size_t size) {
  if (buf == nullptr || size == 0U) {
    return 0;
  }
  size_t copied = 0U;
  while (copied < size) {
    const int ch = read();
    if (ch < 0) {
      break;
    }
    buf[copied++] = static_cast<uint8_t>(ch);
  }
  return static_cast<int>(copied);
}

size_t BLEUart::write(uint8_t b) { return write(0U, &b, 1U); }

size_t BLEUart::write(const uint8_t* content, size_t len) { return write(0U, content, len); }

size_t BLEUart::write(uint16_t conn_hdl, uint8_t b) { return write(conn_hdl, &b, 1U); }

size_t BLEUart::write(uint16_t conn_hdl, const uint8_t* content, size_t len) {
  (void)conn_hdl;
  if (content == nullptr || len == 0U || !notifyEnabled()) {
    return 0U;
  }

  size_t sent = 0U;
  while (sent < len) {
    const uint16_t chunk =
        min<uint16_t>(BleRadio::kCustomGattMaxValueLength, static_cast<uint16_t>(len - sent));
    if (!_txd.notify(&content[sent], chunk)) {
      break;
    }
    sent += chunk;
    if (sent < len) {
      delay(5);
    }
  }
  return sent;
}

int BLEUart::available() { return _rx_count; }

int BLEUart::peek() {
  if (_rx_count == 0U) {
    return -1;
  }
  return _rx_fifo[_rx_tail];
}

void BLEUart::flush() {}

void BLEUart::handleRx(uint16_t conn_hdl, const uint8_t* data, uint16_t len) {
  uint16_t dropped = 0U;
  for (uint16_t i = 0U; i < len; ++i) {
    if (_rx_count >= _rx_fifo_depth) {
      ++dropped;
      continue;
    }
    _rx_fifo[_rx_head] = data[i];
    _rx_head = static_cast<uint16_t>((_rx_head + 1U) % _rx_fifo_depth);
    ++_rx_count;
  }
  if (dropped > 0U && _overflow_cb != nullptr) {
    _overflow_cb(conn_hdl, dropped);
  }
  if (_rx_cb != nullptr) {
    _rx_cb(conn_hdl);
  }
}

void BLEUart::bleuart_rxd_cb(uint16_t conn_hdl, BLECharacteristic* chr, uint8_t* data,
                             uint16_t len) {
  auto& service = static_cast<BLEUart&>(chr->parentService());
  service.handleRx(conn_hdl, data, len);
}

void BLEUart::bleuart_txd_cccd_cb(uint16_t conn_hdl, BLECharacteristic* chr, uint16_t value) {
  auto& service = static_cast<BLEUart&>(chr->parentService());
  if (service._notify_cb != nullptr) {
    service._notify_cb(conn_hdl, (value & 0x0001U) != 0U);
  }
}

AdafruitBluefruit::AdafruitBluefruit()
    : Periph(),
      Central(),
      Security(),
      Gatt(),
      Advertising(),
      ScanResponse(true),
      Scanner(),
      Discovery(),
      device_name_{0},
      tx_power_(0),
      appearance_(0),
      auto_conn_led_(false),
      conn_led_interval_ms_(500UL) {
  strncpy(device_name_, "XIAO nRF54L15", sizeof(device_name_) - 1U);
}

void AdafruitBluefruit::configServiceChanged(bool changed) { (void)changed; }

void AdafruitBluefruit::configUuid128Count(uint8_t uuid128_max) { (void)uuid128_max; }

void AdafruitBluefruit::configAttrTableSize(uint32_t attr_table_size) {
  (void)attr_table_size;
}

void AdafruitBluefruit::configPrphConn(uint16_t mtu_max, uint16_t event_len,
                                       uint8_t hvn_qsize, uint8_t wrcmd_qsize) {
  (void)mtu_max;
  (void)event_len;
  (void)hvn_qsize;
  (void)wrcmd_qsize;
}

void AdafruitBluefruit::configCentralConn(uint16_t mtu_max, uint16_t event_len,
                                          uint8_t hvn_qsize, uint8_t wrcmd_qsize) {
  (void)mtu_max;
  (void)event_len;
  (void)hvn_qsize;
  (void)wrcmd_qsize;
}

