lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
void AdafruitBluefruit::configPrphBandwidth(uint8_t bw) { (void)bw; }

void AdafruitBluefruit::configCentralBandwidth(uint8_t bw) { (void)bw; }

bool AdafruitBluefruit::begin(uint8_t prph_count, uint8_t central_count) {
  return manager().begin(prph_count, central_count);
}

void AdafruitBluefruit::setName(const char* str) {
  if (str == nullptr) {
    return;
  }
  strncpy(device_name_, str, CFG_MAX_DEVNAME_LEN);
  device_name_[CFG_MAX_DEVNAME_LEN] = '\0';
  manager().radio().setGattDeviceName(device_name_);
  manager().markAdvertisingDirty();
}

uint8_t AdafruitBluefruit::getName(char* name, uint16_t bufsize) {
  if (name == nullptr || bufsize == 0U) {
    return 0U;
  }
  const size_t len = strlen(device_name_);
  const uint16_t copyLen = min<uint16_t>(bufsize - 1U, static_cast<uint16_t>(len));
  memcpy(name, device_name_, copyLen);
  name[copyLen] = '\0';
  return static_cast<uint8_t>(copyLen);
}

bool AdafruitBluefruit::setTxPower(int8_t power) {
  tx_power_ = power;
  manager().markAdvertisingDirty();
  return manager().radio().setTxPowerDbm(power);
}

int8_t AdafruitBluefruit::getTxPower() const { return tx_power_; }

bool AdafruitBluefruit::setAppearance(uint16_t appearance) {
  appearance_ = appearance;
  return manager().radio().setGattAppearance(appearance);
}

uint16_t AdafruitBluefruit::getAppearance() const { return appearance_; }

void AdafruitBluefruit::autoConnLed(bool enabled) {
  auto_conn_led_ = enabled;
  if (enabled) {
    pinMode(LED_BUILTIN, OUTPUT);
    digitalWrite(LED_BUILTIN,
                 manager().radio().isConnected() ? kLedOnState : kLedOffState);
  }
}

void AdafruitBluefruit::setConnLedInterval(uint32_t ms) { conn_led_interval_ms_ = ms; }

uint8_t AdafruitBluefruit::connected() const { return manager().radio().isConnected() ? 1U : 0U; }

bool AdafruitBluefruit::connected(uint16_t conn_hdl) const {
  return (conn_hdl == 0U) && manager().radio().isConnected();
}

uint8_t AdafruitBluefruit::getConnectedHandles(uint16_t* hdl_list, uint8_t max_count) const {
  if (hdl_list == nullptr || max_count == 0U || !manager().radio().isConnected()) {
    return 0U;
  }
  hdl_list[0] = 0U;
  return 1U;
}

uint16_t AdafruitBluefruit::connHandle() const {
  return manager().radio().isConnected() ? 0U : INVALID_CONNECTION_HANDLE;
}

bool AdafruitBluefruit::disconnect(uint16_t conn_hdl) {
  if (conn_hdl != 0U || !manager().radio().isConnected()) {
    return false;
  }
  return manager().radio().disconnect();
}

void AdafruitBluefruit::setRssiCallback(void (*fp)(uint16_t conn_hdl, int8_t rssi)) {
  (void)fp;
}

BLEConnection* AdafruitBluefruit::Connection(uint16_t conn_hdl) {
  if (conn_hdl != 0U || !manager().radio().isConnected()) {
    return nullptr;
  }
  return manager().connection();
}
